content/posts/2021-04-24-bio-pages-multiscale-writing-and-xpa.en.md
+++
title = "Bio Pages, Multiscale Writing, and XPA"
date = 2021-04-24T21:44:00-05:00
draft = false
+++

Or, a roundabout way of explaining why I don't have an dedicated "About" page.


## Bio Pages {#bio-pages}

I find bio pages hard to write.

I've always despised bio pages that sound like:

> Scott Danger Solo, MIB, is a WHSA certified Sigma-level worm-hole surfing professional that shoots first, crosses the streams, and thinks 4th-dimensionally.

It grosses me out the same way that ego-flavored bubble gums would. I can't help but take these statements as a desperate attempt at smearing online contents with every last drop of legitimacy squeezed out of grand-yet-insincere-sounding words.

Most of the time, I opt to not include a bio on my online presences. Among the few exceptions is my old WordPress blog where I put:

> EE major; new to WP and not very good at it; weeb; disproportional appetite for new hardware compared to my wallet size; may appear on social networks as `shimmy1996`; let's be friends XDD.

Even that felt too revealing for me. In other cases, I just use random made up sci-fi one-liners, for instance:

> University of Trantor, Extraterrestrial Lifeform Breeding and Culinary Arts Major

Coming up with imaginary professions is actually a lot of fun and I can do this all day long. Just to give you a sneak peek at my stockpile:

-   Supervillain mechanic (the kind that engages in their repair and restoration, not actually in taking over the world);
-   Saturnian folklore and Demonology enthusiast;
-   Native speaker of Fishish (a dialect of Atlantish, used by most crustaceans and aquatic mammals in the North Atlantic Ocean; confusing name, I know);
-   Genff panel (chorono-voltaic modules, think about it as a reversed flux capacitor) technician;
-   Collector of ultrasonic music (no, that does not include Snake Jazz, they are inferior to Whale Blues or Bat Rock);
-   Star magnitude calibration specialist;
-   Dream composition and cinematography expert.

The list would have been longer if full-spectrum photography is not actually a thing.

Ah, see how easily I get distracted by these? Back to bio pages on a version of Earth where birds (or Biofueled InspectoR Drones if you prefer) are real and tree octopus aren't, unfortunately.

Why do I always read bio pages under the assumption that they are written with the purpose of exerting authority or "crafting your personal brand"? Wouldn't that make me, who is showing contempt and animosity towards others' qualifications, the one actually displaying syndromes bordering superiority complex? Is it being brought up hearing "modesty is the best policy" all the time finally backfiring? What should the bio page contain anyways? If the purpose is to sprinkle a few hashtags for others to shoehorn my personality into, I would rather not provide such a distraction from contents of the site. Then again, one can argue that if my personality as manifested through the site is easily swayed by the bio page, perhaps the contents aren't really speaking much for themselves after all.


## Multiscale Writing {#multiscale-writing}

I currently classify contents on this site loosely into three categories:

-   Posts: anything with a publish time and a title;
-   Hoots: anything with a publish time but without a title;
-   Fixed: anything without a publish time.

Up till now, I have always put bio pages under the "fixed" category. However, I have come to realize this have more subtle implications.

This first came struck me as I was casually browsing my RSS reader and landed on a blog post without any indication of publish time. Since I vaguely recognize the page title from memory, I instinctively scanned through the page, searching for a timestamp of any kind. After some detective work, I was able to date the post by checking the HTML source. Realizing that this page was published long ago and only showed up in my RSS reader again due to updated feeds, I promptly left the page. Could there have been subtle wording changes? Maybe, but I didn't remember my first read well enough to recognize them. Could there have been substantial additions? Equally likely, but unless there's a FOMO-inducing "updated XXXX-XX-XX" in huge red fonts, I doubt I would have scrolled down. On a related note, I also see blogs displaying not only publish time, but also a glaring banner warning the readers that the contents may be out of date and the author's opinions may have changed since. Funny how the latter is apparently no longer obvious short of an explicit no-responsibility clause now, but it does illustrate the point: I treat pages without any indication of publish time as ones set in stone, completed works, and ultimate truths of the universe (from the author's view).

There's a mismatch between what I hoped to express through bio pages and the typical fixed page format itself. Well, what are the alternatives? I don't want an [E/N site](https://sawv.org/en.html), as I value the process of organizing my fragments of thoughts as much as, if not more than, the process of collecting them. I've played around with the idea of a [personal wiki](https://alexschroeder.ch/), but I would like to have separate pages for "major versions", instead of cramming all edits, regardless of importance, into editing history. While for technical contents, latest edition with all the errata incorporated is naturally the most desirable, I don't view my former self necessarily as obsolete or wrong, yet I also don't want to mix past and present on the same page "[long content](https://www.gwern.net/About#long-content)" style.

I want bio pages to be condensed me-flavored words, which would be a moving target that a fixed page will forever be playing catching up with as my thoughts evolve over time. Between fixed pages and posts, there is a missing time scale: I need something that manifests change faster than a fixed page, but more long-lasting than regular dated post.


## XPA (eXtensible Personality Archive) {#xpa--extensible-personality-archive}

Cool name, right? It's a happy accident that XPA is also the name of a protein (and the corresponding gene) [responsible for repairing DNA damage](https://en.wikipedia.org/wiki/XPA#Function).

Now, now, before discounting this as unnecessary formality, hear me out. Instead of a single fixed bio page, I think the most fitting substitute is a collection of gradually updated documents, not dissimilar to chapters of a book. While some books, like manga or web novels, are normally published chapter after chapter non-stop Markov-process-style, I'm thinking more of a non-linear progression where rewrites and revisions can happen more frequently.

Some blogs I visit feature sections named "articles" or "opinions" that are distinct from "posts" and serve similar purposes. The format I have in mind though is closer to [RFCs](https://www.ietf.org/standards/rfcs/), [PEPs](https://www.python.org/dev/peps/), etc. XPAs would be numbered, each XPA would be a dump of my current thoughts and personality pertaining to a specific topic, and they can be superseded by a later one with similar coverage. Meanwhile, posts are reserved for concrete things I did or experienced. In other words, XPAs contains literal states of my mind and posts/hoots serve to document some of the incremental changes between those states.

Following its definition strictly, XPA is actually a much more flexible format than I originally thought: reviews could also fall under its umbrella, for instance. Great Scott, just think about all the possibilities! Now the only remaining bike-shedding to be done before I can get started is to determine how XPAs should be presented on the site, whether I count from 0, which numerical system to use, how should we format the identifiers...

Hmm, naming really is hard isn't it.
